#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/el-brando/gke_workspace/runs/run-bvE2fDkZQaq4Eipj

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.gke_google_template.module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=1tfx]
module.gke_google_template.module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/brandonsgcp/serviceAccounts/tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=brandonsgcp/roles/logging.logWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=brandonsgcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=brandonsgcp/roles/monitoring.viewer/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_container_cluster.primary: Refreshing state... [id=projects/brandonsgcp/locations/us-west1/clusters/test-cluster]
module.gke_google_template.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=brandonsgcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com]
module.gke_google_template.module.gke.google_container_node_pool.pools["test-node-pool"]: Refreshing state... [id=projects/brandonsgcp/locations/us-west1/clusters/test-cluster/nodePools/test-node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.gke_google_template.module.gke.google_container_cluster.primary has been changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/brandonsgcp/locations/us-west1/clusters/test-cluster"
        name                        = "test-cluster"
      + resource_labels             = {}
        # (27 unchanged attributes hidden)










      ~ node_pool {
            name                = "default-pool"
            # (6 unchanged attributes hidden)


          ~ node_config {
              + tags              = []
                # (12 unchanged attributes hidden)


                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }




        # (13 unchanged blocks hidden)
    }
  # module.gke_google_template.module.gke.google_container_node_pool.pools["test-node-pool"] has been deleted
  - resource "google_container_node_pool" "pools" {
      - cluster            = "test-cluster" -> null
      - id                 = "projects/brandonsgcp/locations/us-west1/clusters/test-cluster/nodePools/test-node-pool" -> null
      - initial_node_count = 80 -> null
      - location           = "us-west1" -> null
      - name               = "test-node-pool" -> null
      - node_locations     = [] -> null
      - project            = "brandonsgcp" -> null

      - autoscaling {
          - max_node_count = 100 -> null
          - min_node_count = 1 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-standard" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS" -> null
          - labels            = {
              - "cluster_name" = "test-cluster"
              - "node_pool"    = "test-node-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-small" -> null
          - metadata          = {
              - "cluster_name"             = "test-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "test-node-pool"
            } -> null
          - oauth_scopes      = [] -> null
          - preemptible       = false -> null
          - service_account   = "tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-test-cluster",
              - "gke-test-cluster-test-node-pool",
            ] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke_google_template.module.gke.google_container_node_pool.pools["test-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "test-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 3
      + instance_group_urls = (known after apply)
      + location            = "us-west1"
      + max_pods_per_node   = (known after apply)
      + name                = "test-node-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "brandonsgcp"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 100
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "test-cluster"
              + "node_pool"    = "test-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-small"
          + metadata          = {
              + "cluster_name"             = "test-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "test-node-pool"
            }
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = "tf-gke-test-cluster-1tfx@brandonsgcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-test-cluster",
              + "gke-test-cluster-test-node-pool",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke_google_template.module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "GOOGLE_CREDENTIALS" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @notjosse, Action: `pull_request`*